[
{
"ID": 1,
"Title": "The Pragmatic Programmer",
"Author": "Andrew Hunt, David Thomas",
"Image": {
"String": "",
"Valid": false
},
"Isbn": "9780132119177",
"CreatedAt": "2022-03-24T21:03:10.254743Z",
"UpdatedAt": "2022-03-24T21:03:10.254743Z",
"ShelfID": {
"Int64": 0,
"Valid": false
},
"UserID": 2,
"GoogleBooksID": {
"String": "5wBQEp6ruIAC",
"Valid": true
},
"Subtitle": "From Journeyman to Master",
"Description": "What others in the trenches say about The Pragmatic Programmer... “The cool thing about this book is that it’s great for keeping the programming process fresh. The book helps you to continue to grow and clearly comes from people who have been there.” —Kent Beck, author of Extreme Programming Explained: Embrace Change “I found this book to be a great mix of solid advice and wonderful analogies!” —Martin Fowler, author of Refactoring and UML Distilled “I would buy a copy, read it twice, then tell all my colleagues to run out and grab a copy. This is a book I would never loan because I would worry about it being lost.” —Kevin Ruland, Management Science, MSG-Logistics “The wisdom and practical experience of the authors is obvious. The topics presented are relevant and useful.... By far its greatest strength for me has been the outstanding analogies—tracer bullets, broken windows, and the fabulous helicopter-based explanation of the need for orthogonality, especially in a crisis situation. I have little doubt that this book will eventually become an excellent source of useful information for journeymen programmers and expert mentors alike.” —John Lakos, author of Large-Scale C++ Software Design “This is the sort of book I will buy a dozen copies of when it comes out so I can give it to my clients.” —Eric Vought, Software Engineer “Most modern books on software development fail to cover the basics of what makes a great software developer, instead spending their time on syntax or technology where in reality the greatest leverage possible for any software team is in having talented developers who really know their craft well. An excellent book.” —Pete McBreen, Independent Consultant “Since reading this book, I have implemented many of the practical suggestions and tips it contains. Across the board, they have saved my company time and money while helping me get my job done quicker! This should be a desktop reference for everyone who works with code for a living.” —Jared Richardson, Senior Software Developer, iRenaissance, Inc. “I would like to see this issued to every new employee at my company....” —Chris Cleeland, Senior Software Engineer, Object Computing, Inc. “If I’m putting together a project, it’s the authors of this book that I want. . . . And failing that I’d settle for people who’ve read their book.” —Ward Cunningham Straight from the programming trenches, The Pragmatic Programmer cuts through the increasing specialization and technicalities of modern software development to examine the core process--taking a requirement and producing working, maintainable code that delights its users. It covers topics ranging from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse. Read this book, and you'll learn how to Fight software rot; Avoid the trap of duplicating knowledge; Write flexible, dynamic, and adaptable code; Avoid programming by coincidence; Bullet-proof your code with contracts, assertions, and exceptions; Capture real requirements; Test ruthlessly and effectively; Delight your users; Build teams of pragmatic programmers; and Make your developments more precise with automation. Written as a series of self-contained sections and filled with entertaining anecdotes, thoughtful examples, and interesting analogies, The Pragmatic Programmer illustrates the best practices and major pitfalls of many different aspects of software development. Whether you're a new coder, an experienced programmer, or a manager responsible for software projects, use these lessons daily, and you'll quickly see improvements in personal productivity, accuracy, and job satisfaction. You'll learn skills and develop habits and attitudes that form the foundation for long-term success in your career. You'll become a Pragmatic Programmer.",
"PageCount": 352,
"Publisher": "Addison-Wesley Professional",
"PageRead": 0
},
{
"ID": 2,
"Title": "C# in Depth",
"Author": "Jon Skeet",
"Image": {
"String": "",
"Valid": false
},
"Isbn": "9781617294532",
"CreatedAt": "2022-03-24T21:03:45.317041Z",
"UpdatedAt": "2022-03-24T21:03:45.317041Z",
"ShelfID": {
"Int64": 0,
"Valid": false
},
"UserID": 2,
"GoogleBooksID": {
"String": "yEoZtAEACAAJ",
"Valid": true
},
"Subtitle": "",
"Description": "Summary C# in Depth, Fourth Edition is your key to unlocking the powerful new features added to the language in C# 5, 6, and 7. Following the expert guidance of C# legend Jon Skeet, you'll master asynchronous functions, expression-bodied members, interpolated strings, tuples, and much more. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the Technology The powerful, flexible C# programming language is the foundation of .NET development. Even after two decades of success, it's still getting better! Exciting new features in C# 6 and 7 make it easier than ever to take on big data applications, cloud-centric web development, and cross-platform software using .NET Core. There's never been a better time to learn C# in depth. About the Book C# in Depth, Fourth Edition is a revised edition of the bestseller written by C# legend Jon Skeet. This authoritative and engaging guide is your key to unlocking this powerful language, including the new features of C# 6 and 7. In it, Jon introduces expression-bodied members, interpolated strings, pattern matching, and more. Real-world examples drive it all home. By the end of this awesome book, you'll be writing C# code with skill, style, and confidence. What's Inside Comprehensive coverage of C# 6 and 7 Greatest hits of C# 2-5 Extended pass-by-reference functionality String interpolation Composition with tuples Decomposition and pattern matching About the Reader For intermediate C# developers. About the Author Jon Skeet is a senior software engineer at Google. He studied mathematics and computer science at Cambridge, is a recognized authority in Java and C#, and maintains the position of top contributor to Stack Overflow. Table of Contents PART 1 C# IN CONTEXT Survival of the sharpest PART 2 C# 2-5 C# 2 C# 3: LINQ and everything that comes with it C# 4: Improving interoperability Writing asynchronous code Async implementation C# 5 bonus features PART 3 C# 6 Super-sleek properties and expression-bodied members Stringy features A smörgåsbord of features for concise code PART 4 C# 7 AND BEYOND Composition using tuples Deconstruction and pattern matching Improving efficiency with more pass by reference Concise code in C# 7 C# 8 and beyond",
"PageCount": 528,
"Publisher": "Pearson Professional",
"PageRead": 0
},
{
"ID": 3,
"Title": "test book",
"Author": "test",
"Image": {
"String": "",
"Valid": false
},
"Isbn": "9992158107452",
"CreatedAt": "2022-03-25T13:56:12.442753Z",
"UpdatedAt": "2022-03-25T13:56:12.442753Z",
"ShelfID": {
"Int64": 0,
"Valid": false
},
"UserID": 2,
"GoogleBooksID": {
"String": "",
"Valid": false
},
"Subtitle": "test",
"Description": "test description",
"PageCount": 0,
"Publisher": "",
"PageRead": 0
}
]